IlleniumDillon/MM32F5277/PinMap/MM32_FSMC_PinMap.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2023-03-16 10:24:45
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2023-03-16 10:51:09
 * @FilePath: \buildd:\ARMFPGA\MM32F5277_Keil\PinMap\MM32_FSMC_PinMap.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
 
#ifndef _MM32_FSMC_PINMAP_H_
#define _MM32_FSMC_PINMAP_H_

#include <MM32_PinMapType.h>

typedef MM32_GPIO_AFPin MM32_FSMC_Pin;

extern MM32_FSMC_Pin FMC_DA4_PA2;
extern MM32_FSMC_Pin FMC_DA5_PA3;
extern MM32_FSMC_Pin FMC_DA6_PA4;
extern MM32_FSMC_Pin FMC_DA7_PA5;

extern MM32_FSMC_Pin FMC_NADV_PB7;
extern MM32_FSMC_Pin FMC_DA13_PB12;
extern MM32_FSMC_Pin FMC_DA0_PB14;

extern MM32_FSMC_Pin FMC_NWE_PC2;
extern MM32_FSMC_Pin FMC_A0_PC3;
extern MM32_FSMC_Pin FMC_NE4_PC4;
extern MM32_FSMC_Pin FMC_NOE_PC5;
extern MM32_FSMC_Pin FMC_DA1_PC6;
extern MM32_FSMC_Pin FMC_DA2_PC11;
extern MM32_FSMC_Pin FMC_DA3_PC12;

extern MM32_FSMC_Pin FMC_DA2_PD0;
extern MM32_FSMC_Pin FMC_DA3_PD1;
extern MM32_FSMC_Pin FMC_NWE_PD2;
extern MM32_FSMC_Pin FMC_CLK_PD3;
extern MM32_FSMC_Pin FMC_NOE_PD4;
extern MM32_FSMC_Pin FMC_NWE_PD5;
extern MM32_FSMC_Pin FMC_NWAIT_PD6;
extern MM32_FSMC_Pin FMC_NE1_PD7;
extern MM32_FSMC_Pin FMC_DA13_PD8;
extern MM32_FSMC_Pin FMC_DA14_PD9;
extern MM32_FSMC_Pin FMC_DA15_PD10;
extern MM32_FSMC_Pin FMC_A16_PD11;
extern MM32_FSMC_Pin FMC_A17_PD12;
extern MM32_FSMC_Pin FMC_A18_PD13;
extern MM32_FSMC_Pin FMC_DA0_PD14;
extern MM32_FSMC_Pin FMC_DA1_PD15;

extern MM32_FSMC_Pin FMC_NBL0_PE0;
extern MM32_FSMC_Pin FMC_NBL1_PE1;
extern MM32_FSMC_Pin FMC_A23_PE2;
extern MM32_FSMC_Pin FMC_A19_PE3;
extern MM32_FSMC_Pin FMC_A20_PE4;
extern MM32_FSMC_Pin FMC_A21_PE5;
extern MM32_FSMC_Pin FMC_A22_PE6;
extern MM32_FSMC_Pin FMC_DA4_PE7;
extern MM32_FSMC_Pin FMC_DA5_PE8;
extern MM32_FSMC_Pin FMC_DA6_PE9;
extern MM32_FSMC_Pin FMC_DA7_PE10;
extern MM32_FSMC_Pin FMC_DA8_PE11;
extern MM32_FSMC_Pin FMC_DA9_PE12;
extern MM32_FSMC_Pin FMC_DA10_PE13;
extern MM32_FSMC_Pin FMC_DA11_PE14;
extern MM32_FSMC_Pin FMC_DA12_PE15;

extern MM32_FSMC_Pin FMC_A0_PF0;
extern MM32_FSMC_Pin FMC_A1_PF1;
extern MM32_FSMC_Pin FMC_A2_PF2;
extern MM32_FSMC_Pin FMC_A3_PF3;
extern MM32_FSMC_Pin FMC_A4_PF4;
extern MM32_FSMC_Pin FMC_A5_PF5;
extern MM32_FSMC_Pin FMC_A6_PF12;
extern MM32_FSMC_Pin FMC_A7_PF13;
extern MM32_FSMC_Pin FMC_A8_PF14;
extern MM32_FSMC_Pin FMC_A9_PF15;

extern MM32_FSMC_Pin FMC_A10_PG0;
extern MM32_FSMC_Pin FMC_A11_PG1;
extern MM32_FSMC_Pin FMC_A12_PG2;
extern MM32_FSMC_Pin FMC_A13_PG3;
extern MM32_FSMC_Pin FMC_A14_PG4;
extern MM32_FSMC_Pin FMC_A15_PG5;
extern MM32_FSMC_Pin FMC_NE2_PG9;
extern MM32_FSMC_Pin FMC_NE3_PG10;
extern MM32_FSMC_Pin FMC_NE4_PG12;
extern MM32_FSMC_Pin FMC_A24_PG13;
extern MM32_FSMC_Pin FMC_A25_PG14;

#endif